In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sqlalchemy import create_engine, text

In [3]:
database_name = 'scooters'    

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

SQL Query for trips with data cleaned

In [5]:
trips = '''
SELECT sumdid, companyname, startdate, starttime, enddate, endtime
FROM trips
WHERE tripduration >= 1.0
	AND tripduration <= (1440)
	OR (tripdistance >= 0 AND tripduration >= 5.0 AND tripduration <= 1440);
'''

with engine.connect() as connection: result = connection.execute(text(trips))

In [6]:
result.fetchone()

('PoweredHP25WXKYBLQ7P', 'Lime', datetime.date(2019, 5, 25), datetime.time(19, 13, 11), datetime.date(2019, 5, 25), datetime.time(19, 25, 57))

In [7]:
with engine.connect() as connection:    
    scooters = pd.read_sql(text(trips), con = connection)

In [8]:
trips = scooters

In [9]:
trips

,sumdid,companyname,startdate,starttime,enddate,endtime
0,PoweredHP25WXKYBLQ7P,Lime,2019-05-25,19:13:11,2019-05-25,19:25:57
1,PoweredSC2SP27KXI3RL,Lime,2019-05-25,19:08:19,2019-05-25,19:26:15
2,PoweredN2GMFHZN34SCN,Lime,2019-05-25,19:24:47,2019-05-25,19:26:07
3,PoweredTGNGBP4WCGWGW,Lime,2019-05-25,19:18:57,2019-05-25,19:26:06
4,Powered7AJ4WRGIBQEIP,Lime,2019-05-25,18:39:34,2019-05-25,19:26:06
...,...,...,...,...,...,...
549425,PoweredTQGSRJ6WUJF7I,Lime,2019-05-25,19:18:42,2019-05-25,19:25:56
549426,Powered5MDNND7AUSCVG,Lime,2019-05-25,19:02:26,2019-05-25,19:25:48
549427,PoweredEUI7XQRCTKP4D,Lime,2019-05-25,19:13:49,2019-05-25,19:25:57
549428,Powered6AJIVTFYYENL6,Lime,2019-05-25,18:39:54,2019-05-25,19:26:02
549429,PoweredGE8F5,Bird,2019-05-25,20:36:26.636666,2019-05-25,20:49:36.013333

In [10]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549430 entries, 0 to 549429
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   sumdid       549430 non-null  object
 1   companyname  549430 non-null  object
 2   startdate    549430 non-null  object
 3   starttime    549430 non-null  object
 4   enddate      549430 non-null  object
 5   endtime      549430 non-null  object
dtypes: object(6)
memory usage: 25.2+ MB

The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

Began working on changing to datetime

In [11]:
trips['startdate'] = pd.to_datetime(trips['startdate'])

In [12]:
trips['startdate'] = pd.to_datetime(trips['startdate'])
trips['enddate'] = pd.to_datetime(trips['enddate'])
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549430 entries, 0 to 549429
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   sumdid       549430 non-null  object
 1   companyname  549430 non-null  object
 2   startdate    549430 non-null  datetime64[ns]
 3   starttime    549430 non-null  object
 4   enddate      549430 non-null  datetime64[ns]
 5   endtime      549430 non-null  object
dtypes: datetime64[ns](2), object(4)
memory usage: 25.2+ MB

In [13]:
trips['startdate'] = pd.to_datetime(trips['startdate'], format = '%m/%d/%Y %I:%M:%S %p')
trips.head()

                 sumdid companyname  startdate starttime    enddate   endtime
0  PoweredHP25WXKYBLQ7P        Lime 2019-05-25  19:13:11 2019-05-25  19:25:57
1  PoweredSC2SP27KXI3RL        Lime 2019-05-25  19:08:19 2019-05-25  19:26:15
2  PoweredN2GMFHZN34SCN        Lime 2019-05-25  19:24:47 2019-05-25  19:26:07
3  PoweredTGNGBP4WCGWGW        Lime 2019-05-25  19:18:57 2019-05-25  19:26:06
4  Powered7AJ4WRGIBQEIP        Lime 2019-05-25  18:39:34 2019-05-25  19:26:06

In [14]:
trips.assign(month = trips['startdate'].dt.month_name()).month.value_counts(sort = False)

May     220004
June    199470
July    129956
Name: month, dtype: int64

In [15]:
(trips
 .assign(date = trips['startdate'].dt.date, 
         hour = trips['startdate'].dt.hour)    
 .groupby(['date'])
 ['sumdid']
 .count()
 .reset_index()
)

          date  sumdid
0   2019-05-01    4501
1   2019-05-02    4234
2   2019-05-03    7542
3   2019-05-04   10018
4   2019-05-05    8016
..         ...     ...
87  2019-07-27    7134
88  2019-07-28    5210
89  2019-07-29    3554
90  2019-07-30    3118
91  2019-07-31    3004

[92 rows x 2 columns]

Number of scooters used on trips per day

In [16]:
trip_count = trips[['companyname', 'startdate', 'sumdid']]\
.groupby(['companyname', 'startdate']).count()

trip_count

                        sumdid
companyname startdate
Bird        2019-05-01    1088
            2019-05-02    1222
            2019-05-03    1962
            2019-05-04    2668
            2019-05-05    1952
...                        ...
SPIN        2019-07-27     608
            2019-07-28     422
            2019-07-29     292
            2019-07-30     227
            2019-07-31     188

[531 rows x 1 columns]

In [17]:
trip_count = trip_count.reset_index()
trip_count

    companyname  startdate  sumdid
0          Bird 2019-05-01    1088
1          Bird 2019-05-02    1222
2          Bird 2019-05-03    1962
3          Bird 2019-05-04    2668
4          Bird 2019-05-05    1952
..          ...        ...     ...
526        SPIN 2019-07-27     608
527        SPIN 2019-07-28     422
528        SPIN 2019-07-29     292
529        SPIN 2019-07-30     227
530        SPIN 2019-07-31     188

[531 rows x 3 columns]

Number of scooters used per company

fixed index

In [18]:
trips_average = '''
SELECT TO_CHAR(startdate, 'YYYY') AS YEAR,
    TO_CHAR(startdate, 'MM') AS MONTH,
	TO_CHAR(startdate, 'DD') AS DAY,
     COUNT( DISTINCT sumdid) /  COUNT(DISTINCT startdate) avg_trips_per_day
    FROM trips
WHERE tripduration >= 1.0
	AND tripduration <= (1440)
	OR (tripdistance >= 0 AND tripduration >= 5.0 AND tripduration <= 1440)
	GROUP BY startdate;
'''

with engine.connect() as connection: result = connection.execute(text(trips_average))

In [19]:
with engine.connect() as connection:    
    trips_average = pd.read_sql(text(trips_average), con = connection)

In [20]:
trips_average

    year month day  avg_trips_per_day
0   2019    05  01               1868
1   2019    05  02               1908
2   2019    05  03               2510
3   2019    05  04               2602
4   2019    05  05               2322
..   ...   ...  ..                ...
87  2019    07  27               2237
88  2019    07  28               1923
89  2019    07  29               1594
90  2019    07  30               1411
91  2019    07  31               1411

[92 rows x 4 columns]

Average number of trips per day but need to get per scooter per company

In [21]:
trips_average = '''
SELECT TO_CHAR(startdate, 'YYYY') AS YEAR,
    TO_CHAR(startdate, 'MM') AS MONTH,
	TO_CHAR(startdate, 'DD') AS DAY,
COUNT (DISTINCT sumdid) AS scooters, COUNT(starttime) AS number_scooter_used_per_day, COUNT(starttime)/COUNT(DISTINCT sumdid) AS avg_scooters_per_day_used
FROM trips
WHERE tripduration >= 1.0
	AND tripduration <= (1440)
	OR (tripdistance >= 0 AND tripduration >= 5.0 AND tripduration <= 1440)
GROUP BY startdate;
'''

with engine.connect() as connection: result = connection.execute(text(trips_average))

In [22]:
with engine.connect() as connection:    
    trips_average = pd.read_sql(text(trips_average), con = connection)

In [23]:
trips_average

    year month day  scooters  number_start_times  avg_scooters_per_day_used
0   2019    05  01      1868                4501                          2
1   2019    05  02      1908                4234                          2
2   2019    05  03      2510                7542                          3
3   2019    05  04      2602               10018                          3
4   2019    05  05      2322                8016                          3
..   ...   ...  ..       ...                 ...                        ...
87  2019    07  27      2237                7134                          3
88  2019    07  28      1923                5210                          2
89  2019    07  29      1594                3554                          2
90  2019    07  30      1411                3118                          2
91  2019    07  31      1411                3004                          2

[92 rows x 6 columns]

The number of times scooters were used everyday and number of available scooters. With the average amount of scooters used per day

In [24]:
trips_average = '''
SELECT companyname, TO_CHAR(startdate, 'YYYY') AS YEAR,
    TO_CHAR(startdate, 'MM') AS MONTH,
	TO_CHAR(startdate, 'DD') AS DAY,
COUNT (DISTINCT sumdid) AS scooters, COUNT(starttime) AS number_scooter_used_per_day, COUNT(starttime)/COUNT(DISTINCT sumdid) AS avg_scooters_per_day_used
FROM trips
WHERE tripduration >= 1.0
	AND tripduration <= (1440)
	OR (tripdistance >= 0 AND tripduration >= 5.0 AND tripduration <= 1440)
GROUP BY startdate, companyname
ORDER BY companyname;
'''

with engine.connect() as connection: result = connection.execute(text(trips_average))

In [25]:
with engine.connect() as connection:    
    trips_average = pd.read_sql(text(trips_average), con = connection)

In [26]:
trips_average

,companyname,year,month,day,scooters,number_start_times,avg_scooters_per_day_used
0,Bird,2019,05,01,713,1088,1
1,Bird,2019,05,02,769,1222,1
2,Bird,2019,05,03,973,1962,2
3,Bird,2019,05,04,1061,2668,2
4,Bird,2019,05,05,867,1952,2
...,...,...,...,...,...,...,...
526,SPIN,2019,07,27,234,608,2
527,SPIN,2019,07,28,187,422,2
528,SPIN,2019,07,29,135,292,2
529,SPIN,2019,07,30,122,227,1
530,SPIN,2019,07,31,102,188,1

average number of scooters used per day by company. I divided the total number of start times per day divided by number of scooters used that day. The start times is also number of times the scooters were used per day.

The question asks to make sure to use scooters was available but I figured by using data from trips table, the scooters were avilable to use (might be wrong and should join with the scooters table?)